import math

L = [0] * 20
for i in range(0, 20):
    P = 1
    for j in range(0, 20):
        if i != j:
            P *= (i - j)
    L[i] = math.pow(i + 1, 19) / P


print("О корректной математической постановке вычислительных задач.")
print(" __________________________________________________________")
print("| {:<2} | {:<15} | {:<15} | {:<15} |" .format("i", "L[i]", "dx[i]", "i+dx[i]"))
print("|----|-----------------|-----------------|-----------------|")
for k in range(0, 20):
    print("| {:<2d} | {:<15e} | {:<15e} | {:<15e} |" .format(k+1, L[k], L[k]*pow(10, -7), k+1+L[k]*pow(10, -7)))
print("|__________________________________________________________|")
print("Вывод: Большие значения Li говорят о том, что корень будет сильно отличаться от значений i.")
